Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.CurvedDimensionTypes Enumeration
 The type of the curved dimension.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum CurvedDimensionTypes
Public Enumeration CurvedDimensionTypes
Members
Member name | Value | Description
Distance | 0 |  The distance of the points is displayed.
Angle | 1 |  The angle is displayed.
See Also
Reference
Tekla.Structures.Drawing Namespace